#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_node_pool.primary_preemptible_nodes must be replaced
-/+ resource "google_container_node_pool" "primary_preemptible_nodes" {
        cluster             = "my-gke-cluster"
      ~ id                  = "projects/durable-footing-243118/locations/us-central1/clusters/my-gke-cluster/nodePools/my-node-pool" -> (known after apply)
      ~ initial_node_count  = 1 -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/durable-footing-243118/zones/us-central1-a/instanceGroupManagers/gke-my-gke-cluster-my-node-pool-2bd1fe6e-grp",
          - "https://www.googleapis.com/compute/v1/projects/durable-footing-243118/zones/us-central1-c/instanceGroupManagers/gke-my-gke-cluster-my-node-pool-5e03333e-grp",
          - "https://www.googleapis.com/compute/v1/projects/durable-footing-243118/zones/us-central1-f/instanceGroupManagers/gke-my-gke-cluster-my-node-pool-0b91acb2-grp",
        ] -> (known after apply)
        location            = "us-central1"
      + max_pods_per_node   = (known after apply)
      ~ name                = "my-node-pool" -> "primary" # forces replacement
      + name_prefix         = (known after apply)
      ~ node_count          = 0 -> 1
      ~ project             = "durable-footing-243118" -> (known after apply)
      + region              = (known after apply)
      ~ version             = "1.14.10-gke.17" -> (known after apply)
      + zone                = (known after apply)

      ~ management {
          ~ auto_repair  = false -> (known after apply)
          ~ auto_upgrade = true -> (known after apply)
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
            machine_type      = "n1-standard-1"
            metadata          = {
                "disable-legacy-endpoints" = "true"
            }
            oauth_scopes      = [
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
            ]
            preemptible       = true
          ~ service_account   = "default" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [] -> (known after apply)

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
